; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj2 obj4 - airport
	obj1 obj3 obj5 - city
	obj6 obj9 obj10 obj11 obj13 obj14 obj16 obj17 - package
	obj7 - airplane
	obj8 obj12 obj15 - truck
)

(:init
	(at obj7 obj0)
	(at obj15 obj4)
	(in-city obj2 obj3)
	(at obj17 obj0)
	(at obj14 obj4)
	(in-city obj0 obj1)
	(at obj13 obj4)
	(in-city obj4 obj5)
	(at obj6 obj2)
	(at obj9 obj4)
	(at obj10 obj4)
	(at obj12 obj2)
	(at obj8 obj0)
	(at obj16 obj4)
	(at obj11 obj0)
)

(:goal (and
	(at obj11 obj4)
	(at obj14 obj0)
	(at obj9 obj2)
	(at obj10 obj2)
	(at obj17 obj2)
	(at obj16 obj0)
	(at obj6 obj4)
	(at obj13 obj2)
))
)

; plan
1. (load obj7 obj17 obj0)
   deleted: (at obj17 obj0)
   added: (in obj17 obj7)
   goals met: 0 of 8
2. (load obj7 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj7)
   goals met: 0 of 8
3. (fly obj7 obj0 obj4)
   deleted: (at obj7 obj0)
   added: (at obj7 obj4)
   goals met: 0 of 8
4. (load obj7 obj9 obj4)
   deleted: (at obj9 obj4)
   added: (in obj9 obj7)
   goals met: 0 of 8
5. (load obj7 obj16 obj4)
   deleted: (at obj16 obj4)
   added: (in obj16 obj7)
   goals met: 0 of 8
6. (load obj7 obj14 obj4)
   deleted: (at obj14 obj4)
   added: (in obj14 obj7)
   goals met: 0 of 8
7. (load obj7 obj13 obj4)
   deleted: (at obj13 obj4)
   added: (in obj13 obj7)
   goals met: 0 of 8
8. (unload obj7 obj11 obj4)
   deleted: (in obj11 obj7)
   added: (at obj11 obj4)
   goals met: 1 of 8
9. (load obj7 obj10 obj4)
   deleted: (at obj10 obj4)
   added: (in obj10 obj7)
   goals met: 1 of 8
10. (fly obj7 obj4 obj0)
   deleted: (at obj7 obj4)
   added: (at obj7 obj0)
   goals met: 1 of 8
11. (unload obj7 obj16 obj0)
   deleted: (in obj16 obj7)
   added: (at obj16 obj0)
   goals met: 2 of 8
12. (unload obj7 obj14 obj0)
   deleted: (in obj14 obj7)
   added: (at obj14 obj0)
   goals met: 3 of 8
13. (fly obj7 obj0 obj2)
   deleted: (at obj7 obj0)
   added: (at obj7 obj2)
   goals met: 3 of 8
14. (unload obj7 obj9 obj2)
   deleted: (in obj9 obj7)
   added: (at obj9 obj2)
   goals met: 4 of 8
15. (load obj7 obj6 obj2)
   deleted: (at obj6 obj2)
   added: (in obj6 obj7)
   goals met: 4 of 8
16. (unload obj7 obj17 obj2)
   deleted: (in obj17 obj7)
   added: (at obj17 obj2)
   goals met: 5 of 8
17. (unload obj7 obj13 obj2)
   deleted: (in obj13 obj7)
   added: (at obj13 obj2)
   goals met: 6 of 8
18. (unload obj7 obj10 obj2)
   deleted: (in obj10 obj7)
   added: (at obj10 obj2)
   goals met: 7 of 8
19. (fly obj7 obj2 obj4)
   deleted: (at obj7 obj2)
   added: (at obj7 obj4)
   goals met: 7 of 8
20. (unload obj7 obj6 obj4)
   deleted: (in obj6 obj7)
   added: (at obj6 obj4)
   goals met: 8 of 8
